UCB_CS61_lec09.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-10 五 00:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第九课 Java 内存 Stack&amp;Heap</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第九课 Java 内存 Stack&amp;Heap</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org65aa937">THE STACK AND THE HEAP</a>
<ul>
<li><a href="#orgf207c96">Parameter Passing</a></li>
<li><a href="#org721aadc">Binary search</a></li>
<li><a href="#org4ce759b">Scope and Recursion</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="org65aa937" class="outline-2">
<h2 id="org65aa937">THE STACK AND THE HEAP</h2>
<div class="outline-text-2" id="text-org65aa937">
<p>
Java stores stuff in two separate pools of memory:  the stack and the heap.
</p>

<blockquote>
<p>
The <span class="underline">heap</span> stores all objects, including all arrays, and all class variables
(i.e. those declared "static").
</p>
</blockquote>

<blockquote>
<p>
The <span class="underline">stack</span> stores all local variables, including all parameters.
</p>
</blockquote>

<p>
When a method is called, the Java Virtual Machine creates a <span class="underline">stack_frame</span> (also
known as an <span class="underline">activation_record</span>) that stores the parameters and local variables
for that method. One method can call another, which can call another, and so on,
so the JVM maintains an internal <span class="underline">stack</span> of stack frames, with "main" at the
bottom, and the most recent method call on top.
</p>

<p>
Here's a snapshot of the stack while Java is executing the SList.insertEnd
method. The stack frames are on the left. Everything on the right half of the
page is in the heap. Read the stack from bottom to top, because that's the order
in which the stack frames were created.
</p>

<pre class="example">
STACK                                         |                            HEAP
                                              |
method call      parameters &amp; local variables |
----------------------------------------------|
                                       ---    |       -------------------
                                  this |.+-----------&gt;|item |.|  next |X|
SListNode.SListNode         ---        ---    |       -------+-----------
                        obj |.+--------------------------\   |
                            ---               |          |   |
----------------------------------------------|          v   v
                            ---               |        ------------
                        obj |.+-----------------------&gt;|  string  |
                            ---               |        ------------
SList.insertEnd             ---               |          ^
                       this |.+--------------------------+---------\
                            ---               |          |         |
----------------------------------------------|          |         |
                            ---               |          |         |
                        str |.+--------------------------/         v
                            ---      ---      |           ---------------------
                                list |.+-----------------&gt;|head |X|  size | 0 |
                                     ---      |           ---------------------
SList.main                  ---               |         ---------   -----------
                       args |.+------------------------&gt;| . | .-+--&gt;|  words  |
                            ---               |         --+------   -----------
                                              |           |    -----------
----------------------------------------------|           \---&gt;|  input  |
                                                               -----------
</pre>

<p>
The method that is currently executing (at any point in time) is the one whose
stack frame is on top. All the other stack frames represent methods waiting for
the methods above them to return before they can continue executing.
</p>

<p>
When a method finishes executing, its stack frame is erased from the top of the
stack, and its local variables are erased forever.
</p>

<p>
The java.lang library has a method "Thread.dumpStack" that prints a list of the
methods on the stack (but it doesn't print their local variables).  This method
can be convenient for debugging&#x2013;for instance, when you're trying to figure out
which method called another method with illegal parameters.
</p>
</div>
