UCB_CS61_lec09.html

<div id="orgf207c96" class="outline-3">
<h3 id="orgf207c96">Parameter Passing</h3>
<div class="outline-text-3" id="text-orgf207c96">
<p>
As in Scheme, Java passes all parameters <span class="underline">by_value</span>.  This means that the
method has <span class="underline">copies</span> of the actual parameters, and cannot change the originals.
The copies reside in the method's stack frame for the method.  The method can
change these copies, but the original values that were copied are not changed.
</p>

<p>
In this example, the method doNothing sets its parameter to 2, but it has no
effect on the value of the calling method's variable a:
</p>

<pre class="example">
method:                            | STACK (just before the method returns)
                                   |
  static void doNothing(int x) {   |      -----
    x = 2;                         |    x | 2 |
  }                                |      -----     stack frame for doNothing
                                   |-----------------------------------------
method call:                       |
                                   |      -----
  int a = 1;                       |    a | 1 |
  doNothing(a);                    |      -----     stack frame for main
</pre>

<p>
When the method call returns, a is still 1.  The doNothing method, as its name
suggests, failed to change the value of a or do anything relevant at all.
</p>

<p>
However, when a parameter is a reference to an object, the reference is copied,
but the object is not; the original object is shared.  A method can modify an
object that one of its parameters points to, and the change will be visible
everywhere.  Here's an example that shows how a method can make a change to an
object that is visible to the calling method:
</p>

<pre class="example">
method:                            | STACK              | HEAP
                                   |                set3|
class IntBox {                     |      -----         |
  public int i;                    |   ib | .-+----------------\
  static void set3(IntBox ib) {    |      -----         |      |
    ib.i = 3;                      |                    |      |
  }                                |--------------------|      v
                                   |      -----         |    ------
method call:                       |    b | .-+-------------&gt;|i |3|
                                   |      -----     main|    ------
  IntBox b = new IntBox();
  set3(b);
</pre>

<p>
For those of you who are familiar with programming languages that have "pass
by reference," the example above is as close as you can get in Java.  But it's
not "pass by reference."  Rather, it's passing a reference by value.
</p>



<p>
Here's an example of a common programming error, where a method tries and fails
to make a change that is visible to the calling method.  (Assume we've just
executed the example above, so b is set up.)
</p>

<pre class="example">
method:                            | STACK              | HEAP
                                   |             badSet4|
class IntBox {                     |      -----         |    ------
  static void badSet4(IntBox ib) { |   ib | .-+-------------&gt;|i |4|
    ib = new IntBox();             |      -----         |    ------
    ib.i = 4;                      |                    |
  }                                |--------------------|
                                   |      -----         |    ------
method call:                       |    b | .-+-------------&gt;|i |3|
                                   |      -----     main|    ------
  badSet4(b);

</pre>
</div>
</div>
