UCB_CS61_lec09.html

<div id="org721aadc" class="outline-3">
<h3 id="org721aadc">Binary search</h3>
<div class="outline-text-3" id="text-org721aadc">
<p>
When a method calls itself recursively, the JVM's internal stack holds two or
more stack frames connected with that method.  Only the top one can be
accessed.
</p>

<p>
Here's a recursive method that searches a sorted array of ints for a particular
int.  Let i be an array of ints sorted from least to greatest&#x2013;for instance,
{-3, -2, 0, 0, 1, 5, 5}.  We want to search the array for the value "findMe".
If we find "findMe", we return its array index; otherwise, we return FAILURE.
</p>

<p>
We could simply check every element of the array, but that would be slow.
A better strategy is to check the middle array element first.  If findMe is
lesser, we know it can only be in the left half of the array; if findMe is
greater, we know it can only be in the right half.  Hence, we've eliminated
half the possibilities with one comparison.  We still have half the array to
check, so we recursively check the middle element of that half, and so on,
cutting the possibilites in half each time.  Suppose we search for 1.
</p>

<pre class="example">
-------------------
| -3 -2 0 0 1 5 5 |
----------^--------
 compare with 0 |
                |
                v
          ---------
          | 1 5 5 |
          ----^----
            | compare with 5
            |
            V
          -----
          | 1 |
          -----
</pre>

<p>
The recursion has two base cases.
</p>
<ol class="org-ol">
<li>If findMe equals the middle element, return its index; in the example above,
we return index 4.</li>
<li><p>
If we try to search a subarray of length zero, the array does not contain
"findMe", and we return FAILURE.
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #4f97d7; font-weight: bold;">final</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">FAILURE</span> = -<span style="color: #a45bad;">1</span>;

<span style="color: #4f97d7; font-weight: bold;">private</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">bsearch</span>(<span style="color: #ce537a; font-weight: bold;">int</span>[] <span style="color: #7590db;">i</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">left</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">right</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">findMe</span>) {
  <span style="color: #4f97d7; font-weight: bold;">if</span> (left &gt; right) {
    <span style="color: #4f97d7; font-weight: bold;">return</span> FAILURE;                   <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Base case 2:  subarray of size zero.</span>
  }
  <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">mid</span> = (left + right) / <span style="color: #a45bad;">2</span>;            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Halfway between left and right.</span>
  <span style="color: #4f97d7; font-weight: bold;">if</span> (findMe == i[mid]) {
    <span style="color: #4f97d7; font-weight: bold;">return</span> mid;                                     <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Base case 1:  success!</span>
  } <span style="color: #4f97d7; font-weight: bold;">else</span> <span style="color: #4f97d7; font-weight: bold;">if</span> (findMe &lt; <span style="color: #ce537a; font-weight: bold;">i</span>[mid]) {
    <span style="color: #4f97d7; font-weight: bold;">return</span> bsearch(i, left, mid - <span style="color: #a45bad;">1</span>, findMe);            <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Search left half.</span>
  } <span style="color: #4f97d7; font-weight: bold;">else</span> {
    <span style="color: #4f97d7; font-weight: bold;">return</span> bsearch(i, mid + <span style="color: #a45bad;">1</span>, right, findMe);          <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Search right half.</span>
  }
}

<span style="color: #4f97d7; font-weight: bold;">public</span> <span style="color: #4f97d7; font-weight: bold;">static</span> <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #bc6ec5; font-weight: bold;">bsearch</span>(<span style="color: #ce537a; font-weight: bold;">int</span>[] <span style="color: #7590db;">i</span>, <span style="color: #ce537a; font-weight: bold;">int</span> <span style="color: #7590db;">findMe</span>) {
  <span style="color: #4f97d7; font-weight: bold;">return</span> bsearch(i, <span style="color: #a45bad;">0</span>, i.length - <span style="color: #a45bad;">1</span>, findMe);
}
</pre>
</div></li>
</ol>

<p>
How long does binary search take? Suppose the array has n elements. In one call
to bsearch, we eliminate at least half the elements from consideration. Hence,
it takes log_2 n (the base 2 logarithm of n) bsearch calls to pare down the
possibilities to one. Binary search takes time proportional to log_2 n. If
you're not comfortable with logarithms.
</p>

<pre class="example">
STACK    bsearch    left [4]             |
                   right [4]  findMe [1] |
                     mid [4]       i [.]-+---------\
         --------------------------------|         |
         bsearch    left [4]             |         |
                   right [6]  findMe [1] |         |
                     mid [5]       i [.]-+---------|
         --------------------------------|         |
         bsearch    left [0]             |         |
                   right [6]  findMe [1] |         |
                     mid [3]       i [.]-+---------|
         --------------------------------|         |
         bsearch  findMe [1]       i [.]-+---------|   -------------------
         --------------------------------|         \--&gt;| -3 -2 0 0 1 5 5 |
         main                   args [.]-+-&gt;[]         -------------------
                                         |                                 HEAP
</pre>

<p>
The stack frames appear at right in the figure above. There are three different
local variables named "left" on the stack, three named "right", three named
"mid", four named "i", and four named "findMe". While the current invocation of
<code>bsearch()</code> is executing, only the topmost copy of "left" is in scope, and
likewise for "right" and "mid". The other copies are hidden and cannot be
accessed or changed until the current invocation of <code>bsearch()</code> terminates.
</p>

<p>
Most operating systems give a program enough stack space for a few thousand
stack frames.  If you use a recursive procedure to walk through a million-node
list, Java will try to create a million stack frames, and the stack will
run out of space.  The result is a run-time error.  You should use iteration
instead of recursion when the recursion will be very deep.
</p>

<p>
However, our recursive binary search method does not have this problem.  Most
modern microprocessors cannot address more than 2^64 bytes of memory.  Even if
an array of bytes takes this much space, we will only have to cut the array in
half 64 times to run a binary search.  There's room on the stack for 64 stack
frames, with plenty to spare.  In general, recursion to a depth of roughly
log n (where n is the number of items in a data structure) is safe, whereas
recursion to a depth of roughly n is not.
</p>

<p>
Unfortunately, binary search can't be used on linked lists.  Think about why.
</p>
</div>
</div>

<div id="org4ce759b" class="outline-3">
<h3 id="org4ce759b">Scope and Recursion</h3>
<div class="outline-text-3" id="text-org4ce759b">
<p>
The <span class="underline">scope</span> of a variable is the portion of the program that can access the
variable.  Here are some of Java's scoping rules.
</p>

<ul class="org-ul">
<li>Local variables and parameters are in scope only inside the method that
declares them, and only for the topmost stack frame.  Furthermore, a local
variable is in scope only from the variable declaration down to the innermost
closing brace that encloses it.  A local variable declared in the
initialization part of a "for" loop is in scope only in the loop body.</li>
<li>Class variables (static fields) are in scope everywhere in the class, except
when shadowed by a local variable or parameter of the same name.</li>
<li>Fully qualified class variables ("System.out", rather than "out") are in
scope everywhere in the class, and cannot be shadowed.  If they're public,
they're in scope in <span class="underline">all</span> classes.</li>
<li>Instance variables (non-static fields) are in scope in non-static methods of
the class, except when shadowed.</li>
<li>Fully qualified instance variables ("amanda.name", "this.i") are in scope
everywhere in the class, and cannot be shadowed.  If they're public, they're
in scope in all classes.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
